tutorials/granularEulerFoam/biomassInclinedFlow/bioIncFric/0/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            coulombSlip;
        ampl            uniform 1;
        value           uniform 0;
    }
    ramp
    {
        type            coulombSlip;
        ampl            uniform 1;
        value           uniform 0;
    }
    top
    {
      type               zeroGradient;
    }
    right
    {
      type               zeroGradient;
    }
    bottom
    {
      type               zeroGradient;
    }
    defaultFaces
    {
        type               empty;
    }
}


// ************************************************************************* //
