tutorials/granularEulerFoam/biomassInclinedFlow/bioIncFric/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../parameters"

phases (particles air);

particles
{
    diameterModel constant;
    constantCoeffs
    {
        d               0.82e-3;
    }

    alphaMax        0.63;
    residualAlpha   1e-6;
}

air
{
    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            none;
        continuousPhase air;
    }
}

sigma
(
    (particles and air) 0
);

aspectRatio
(
);

drag
(
    (particles in air)
    {
      type            KozenyCarman;//SyamlalOBrien;//Lain;//GidaspowSchillerNaumann;//Gibilaro;//Ergun;//SchillerNaumann;//GidaspowErgunWenYu;
      nuC 1.2e-5;
      residualRe      1e-3;
      swarmCorrection
        {
	  type        none;
        }
    }
 );

virtualMass
(
    (particles in air)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (particles in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            $pR0;


// ************************************************************************* //
